export const aromatherapyData: {
  [key: string]: {
    oil: string;
    recipe: string;
    activity: string;
  }
} = {
  happy: {
    oil: "Лавандовое масло - для поддержания хорошего настроения",
    recipe: "Фруктовый салат с киноа и мятой",
    activity: "Медитация благодарности"
  },
  sad: {
    oil: "Масло бергамота - для поднятия настроения",
    recipe: "Шоколадный пудинг из авокадо",
    activity: "Прогулка на природе"
  },
  stressed: {
    oil: "Масло ромашки - для успокоения",
    recipe: "Успокаивающий чай из ромашки и лаванды",
    activity: "Глубокое дыхание и растяжка"
  },
  relaxed: {
    oil: "Масло иланг-иланг - для поддержания расслабленного состояния",
    recipe: "Смузи боул с бананом и черникой",
    activity: "Йога нидра"
  },
  energetic: {
    oil: "Масло мяты перечной - для поддержания энергии",
    recipe: "Энергетические шарики из фиников и орехов",
    activity: "Танцевальная разминка"
  }
}

